<script setup>
import SectionFirst from '@/components/SectionFirst.vue';
import AIImage from '@/assets/images/AI.jpg';
const h41 = "Искусственный интеллект";
const descriptionText = "Искусственный интеллект (ИИ) — это одна из самых захватывающих и быстро развивающихся технологий нашего времени. Он представляет собой область компьютерных наук,которая занимается созданием систем, способных выполнять задачи, требующиечеловеческого интеллекта. Это включает в себя обучение, понимание естественного языка,распознавание образов, принятие решений и многое другое.";

import AIImage1 from '@/assets/images/VR.jpg';
const h42 = "Виртуальная реальность"
const text1 = "Виртуальная реальность (VR) — это захватывающая технология, позволяющаяпользователям погружаться в полностью симулированные миры.С помощью специальных гарнитур и контроллеров, VR создаетуникальный опыт, который находит применение в развлечениях,образовании и медицине, открывая новые горизонтыдля взаимодействия с цифровым контентом."

import AIImage2 from '@/assets/images/BlockChain.jpg';
const h43 = "Блокчейн"
const text2 = "Блокчейн — это инновационная технология, представляющая собойраспределенную базу данных, которая обеспечивает безопасностьи прозрачность транзакций. Она находит применение в различныхсферах, включая финансы, логистику и управление данными,создавая новые возможности для бизнеса и пользователей."

</script>

<template>
    <main>
        <div class="container1">
            <h2>Актуальные технологии</h2>
            <SectionFirst :imagePath="AIImage" :description="descriptionText" :name="h41"/>
            <SectionFirst :imagePath="AIImage1" :description="text1" :name="h42"/>
            <SectionFirst :imagePath="AIImage2" :description="text2" :name="h43"/>
        </div>
</main> 
</template>
